export const timelineData = [
  {
    year: "2025",
    events: [
      { month: "02", text: "성남금광 가맹점 오픈" },
      { month: "01", text: "속초 가맹점 오픈" },
    ],
  },
  {
    year: "2024",
    events: [
      { month: "09", text: "강남대치 가맹점 오픈\n인천청라 가맹점 오픈" },
      { month: "08", text: "마곡발산 가맹점 오픈" },
      { month: "07", text: "안산 가맹점 오픈\n역곡역 가맹점 오픈" },
      { month: "05", text: "전주서신 가맹점 오픈\n상봉역 가맹점 오픈" },
      { month: "02", text: "울산울주 가맹점 오픈" },
      { month: "01", text: "강릉경포 가맹점 오픈" },
    ],
  },
  {
    year: "2023",
    events: [
      { month: "11", text: "테크노폴리스 가맹점 오픈 \n 서대구 가맹점 오픈 " },
      { month: "09", text: "강남양재 가맹점 오픈" },
      { month: "08", text: "김포구래 가맹점 오픈" },
      { month: "07", text: "남양주 직영점 오픈 \n 광명역사 가맹점 오픈" },
      { month: "06", text: "이시아폴리스 가맹점 오픈" },
      { month: "05", text: "죽곡 가맹점 오픈 \n 상인 가맹점 오픈" },
      { month: "03", text: "명지 직영점 오픈" },
      { month: "02", text: "칠곡 가맹점 오픈" },
      { month: "01", text: "청주 가맹점 오픈" },
    ],
  },
  {
    year: "2022",
    events: [
      { month: "12", text: "익산 가맹점 오픈" },
      { month: "11", text: "경산 가맹점 오픈" },
      { month: "10", text: "여수 가맹점 오픈 \n 신제주 직영점 오픈" },
      { month: "09", text: "순천 가맹점 오픈" },
      { month: "06", text: "가맹사업 전개" },
    ],
  },
  {
    year: "2021",
    events: [
      { month: "12", text: "SAMSONG 1957" },
      { month: "10", text: "성수점 오픈" },
    ],
  },
  {
    year: "2020",
    events: [{ month: "02", text: "야탑역사점 오픈" }],
  },
  {
    year: "2019",
    events: [
      { month: "06", text: "부천역사점 오픈" },
      { month: "03", text: "수성대학교 에스랩(삼송외식연구소)오픈" },
    ],
  },
  {
    year: "2018",
    events: [
      { month: "05", text: "신논현역 오픈" },
      { month: "04", text: "동탄점 오픈" },
      { month: "02", text: "인천공항점 오픈" },
    ],
  },
  {
    year: "2017",
    events: [
      { month: "12", text: "강남 고속버스터미널역 입점" },
      { month: "09", text: "잠실광장점 오픈" },
      {
        month: "08",
        text: "스타필드 고양점 입점 \n 통옥수수빵, 야채코로케, 먹물통옥수수빵 특허등록 \n 롯데백화점 구리점 입점",
      },
      { month: "07", text: "용산역사점 오픈" },
      { month: "06", text: "김포공항점 오픈" },
      { month: "04", text: "롯데피트인 산본점 입점 \n 교보합정점 오픈" },
      { month: "03", text: "롯데백화점 명동 본점 입점 \n 롯데엘큐브리빙 세종점 입점" },
      { month: "01", text: "디큐브백화점 거제점 입점" },
    ],
  },
  {
    year: "2016",
    events: [
      {
        month: "12",
        text: "아브뉴프랑 광교점 오픈 \n SRT 수서역사점 오픈 \n 롯데백화점 강남점 입점 \n 롯데백화점 평촌점 입점",
      },
      { month: "10", text: "현대백화점 미아점 입점" },
      {
        month: "09",
        text: "롯데몰 진주점 입점 \n 신세계백화점 하남점 입점 \n 현대 프리미엄 아울렛 김포점 입점",
      },
      { month: "08", text: "현대백화점 충청점 입점 \n 롯데백화점 노원점 입점" },
      { month: "07", text: "롯데백화점 부산본점 입점 \n 신세계백화점 명동점 입점" },
      { month: "06", text: "신세계백화점 김해점 입점" },
      { month: "04", text: "현대 프리미엄 아울렛 송도점 입점 \n 신세계백화점 영등포점 입점 " },
      { month: "03", text: "현대 시티 아울렛 동대문점 입점" },
      { month: "02", text: "창원상남점 오픈 \n 신세계백화점 센텀시티점 입점" },
    ],
  },
  {
    year: "2015",
    events: [
      { month: "12", text: "울산삼산점 오픈 \n 현대백화점 울산점 입점 \n 부산남포점 오픈 \n 현대백화점 압구정점 입점" },
      { month: "09", text: "현대백화점 무역점 입점" },
      { month: "08", text: "현대백화점 판교점 입점" },
      { month: "07", text: "현대백화점 대구점 입점" },
      { month: "04", text: "동대구역사점오픈" },
    ],
  },
  {
    year: "2008",
    events: [{ text: "국내 최초 구운 고로케 개발 및 통옥수수빵(일명 마약빵) 출시" }],
  },
  {
    year: "1997",
    events: [{ text: "대구 동성로점 2층 확장" }],
  },
  {
    year: "1987",
    events: [{ text: "대구 동성로점 확장이전" }],
  },
  {
    year: "1976",
    events: [{ text: "대구 달성동 영화제과 오픈" }],
  },
  {
    year: "1965",
    events: [{ text: "대구 대신동으로 이전" }],
  },
  {
    year: "1957",
    events: [{ text: "대구 남문시장 삼송제과 오픈" }],
  },
];
